src/bsl/Catalogs/гкс_ПодключениеКВебСервисам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>гкс_ПодключениеКВебСервисам</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сервер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Таймаут</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьЗащищенноеСоединение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьАутентификациюОС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьПрокси</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроксиСервер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроксиПорт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТехнологияОбмена</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_ТехнологииОбменаДанными</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресWSDL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>URIПространстваИмен</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяСервиса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяТочкиПодключения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/bsl/Enums/гкс_ТехнологииОбменаДанными.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>гкс_ТехнологииОбменаДанными</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>REST</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SOAP</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/bsl/Catalogs/гкс_ПодключениеКВебСервисам/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция возвращает настройки подключения
//
// Возвращаемое значение:
// Структура - структура с данными подключения
//
Функция НастройкиПодключения(ВладельцНастроек) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПодключениеКВебСервисам.Сервер КАК Сервер,
		|	ПодключениеКВебСервисам.Порт КАК Порт,
		|	ПодключениеКВебСервисам.АдресWSDL КАК АдресWSDL,
		|	ПодключениеКВебСервисам.ТехнологияОбмена КАК ТехнологияОбмена,
		|	ПодключениеКВебСервисам.Таймаут КАК Таймаут,
		|	ПодключениеКВебСервисам.ИспользоватьАутентификациюОС КАК ИспользоватьАутентификациюОС,
		|	ПодключениеКВебСервисам.ИспользоватьЗащищенноеСоединение КАК ИспользоватьЗащищенноеСоединение
		|ИЗ
		|	Справочник.гкс_ПодключениеКВебСервисам КАК ПодключениеКВебСервисам
		|ГДЕ
		|	ПодключениеКВебСервисам.Ссылка = &Ссылка";

	Запрос.УстановитьПараметр("Ссылка", ВладельцНастроек);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Если ВыборкаДетальныеЗаписи.Следующий() Тогда

		НастройкиПодключения = СтруктураНастроекПоТипуСервиса(ВыборкаДетальныеЗаписи.ТехнологияОбмена);
		ЗаполнитьЗначенияСвойств(НастройкиПодключения, ВыборкаДетальныеЗаписи);

		Если ВыборкаДетальныеЗаписи.ИспользоватьАутентификациюОС Тогда
			НастройкиПодключения.ИспользоватьАутентификациюОС = Истина;
		Иначе
			НастройкиПодключения.ИспользоватьАутентификациюОС = Ложь;

			ИмяПарольПользователя = ИмяПарольПользователя(ВладельцНастроек);
			НастройкиПодключения.ИмяПользователя = ИмяПарольПользователя.Пользователь;
			НастройкиПодключения.Пароль	= ИмяПарольПользователя.Пароль;
		КонецЕсли;

	Иначе
		НастройкиПодключения = Неопределено;
	КонецЕсли;

	Возврат НастройкиПодключения;

КонецФункции

// Функция возвращает настройки подключения
//
// Возвращаемое значение:
// Структура - структура с данными подключения
//				├ Пользователь - строка - логин
//				├ Пароль - строка - пароль
//
Функция ИмяПарольПользователя(ВладельцНастроек) Экспорт

	УстановитьПривилегированныйРежим(Истина);

	Результат = Новый Структура;
	Результат.Вставить("Пользователь", "");
	Результат.Вставить("Пароль", "");

	ДанныеБХ = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(ВладельцНастроек, "ИмяПарольПользователя");

	Если Не ДанныеБХ = Неопределено Тогда
		Результат.Пользователь = ДанныеБХ.ИмяПользователя;
		Результат.Пароль = ДанныеБХ.ПарольПользователя;
	КонецЕсли;

	Возврат Результат;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СтруктураНастроекПоТипуСервиса(ТипСервиса)

	НастройкиПодключения = Новый Структура;
	НастройкиПодключения.Вставить("ИмяПользователя");
	НастройкиПодключения.Вставить("Пароль");
	НастройкиПодключения.Вставить("Таймаут", 0);
	НастройкиПодключения.Вставить("ИспользоватьАутентификациюОС", Ложь);
	НастройкиПодключения.Вставить("ИспользоватьЗащищенноеСоединение", Ложь);

	Если ТипСервиса = Перечисления.гкс_ТехнологииОбменаДанными.SOAP Тогда
		НастройкиПодключения.Вставить("АдресWSDL");
	Иначе
		НастройкиПодключения.Вставить("Сервер");
    	НастройкиПодключения.Вставить("Порт");
	КонецЕсли;

	Возврат НастройкиПодключения;

КонецФункции

#КонецОбласти

#КонецЕсли
